eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/sl_wfx.c
  /* Get secure link mode */
  link_mode = startup_info->body.capabilities.linkmode;

  result = sl_wfx_host_get_secure_link_mac_key(sl_wfx_context->secure_link_mac_key);

  if (result == SL_STATUS_OK) {
    switch (link_mode) {
      case SL_WFX_LINK_MODE_RESERVED:
        break;
      case SL_WFX_LINK_MODE_UNTRUSTED:
        break;
      case SL_WFX_LINK_MODE_TRUSTED_EVAL:
        /* In this mode it is assumed that the key is not burned */
        result = sl_wfx_secure_link_set_mac_key(sl_wfx_context->secure_link_mac_key, SECURE_LINK_MAC_KEY_DEST_RAM);
        SL_WFX_ERROR_CHECK(result);
      /* Falls through on purpose */
      case SL_WFX_LINK_MODE_ACTIVE:
        // Exchange keys is only message that can be sent unencrypted
        // when *Trusted* mode is enabled. After exchanging keys we can change
        // the encryption bitmap without restrictions.

        result = sl_wfx_secure_link_renegotiate_session_key();
        SL_WFX_ERROR_CHECK(result);
#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_SLK)
        sl_wfx_host_log("--Set SL Bitmap--\r\n");
#endif
        // Set the initial encryption bitmap regarding the *Secure Link* mode:
        // - For *Trusted Eval* state: all encrypted messages except SL_CONFIGURE.
        // - For *Trusted Enforced* state: all encrypted messages including SL_CONFIGURE.
        // This Host default bitmap mimics the device default bitmap
        sl_wfx_secure_link_bitmap_set_all_encrypted(sl_wfx_context->encryption_bitmap);
        if (link_mode == SL_WFX_LINK_MODE_TRUSTED_EVAL) {
          sl_wfx_secure_link_bitmap_remove_request_id(sl_wfx_context->encryption_bitmap, SL_WFX_SECURELINK_CONFIGURE_REQ_ID);
#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_SLK)
          sl_wfx_host_log("--Trusted Eval mode--\r\n");
#endif
        }
        // Send this bitmap to the device
        result = sl_wfx_secure_link_configure(sl_wfx_context->encryption_bitmap, 0);
        SL_WFX_ERROR_CHECK(result);
#if (SL_WFX_DEBUG_MASK & (SL_WFX_DEBUG_INIT | SL_WFX_DEBUG_SLK))
        sl_wfx_host_log("--Secure Link set--\r\n");
#endif
        break;
      default:
        goto error_handler;
    }
  }
#endif //SL_WFX_USE_SECURE_LINK

  result = sl_wfx_host_get_pds_size(&pds_size);
  SL_WFX_ERROR_CHECK(result);
  /* Sending to Wi-Fi chip PDS configuration (Platform data set) */
  for (uint8_t a = 0; a < pds_size; a++) {
    result = sl_wfx_host_get_pds_data(&pds_data, a);
    SL_WFX_ERROR_CHECK(result);
    result = sl_wfx_send_configuration(pds_data, strlen(pds_data));
    SL_WFX_ERROR_CHECK(result);
  }

#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_INIT)
  sl_wfx_host_log("--PDS configured--\r\n");
#endif

  sl_wfx_context->state = SL_WFX_STARTED;

  error_handler:
  if (result != SL_STATUS_OK) {
    sl_wfx_disable_irq( );
    sl_wfx_deinit_bus();
    sl_wfx_host_deinit();
  }

  return result;
}

/**************************************************************************//**
 * @brief Deinit the Wi-Fi chip
 *
 * @returns Returns SL_STATUS_OK if the deinitialization is successful,
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_deinit(void)
{
  sl_status_t result;

  result = sl_wfx_shutdown();
  SL_WFX_ERROR_CHECK(result);

  result = sl_wfx_disable_irq();
  SL_WFX_ERROR_CHECK(result);

  result = sl_wfx_deinit_bus();
  SL_WFX_ERROR_CHECK(result);

  error_handler:
  return result;
}

/**************************************************************************//**
 * @addtogroup FULL_MAC_DRIVER_API
 * @{
 *****************************************************************************/

/**************************************************************************//**
 * Brief Set the MAC address used by Wi-Fi chip
 *
 * @param mac is the MAC address to be set on the specified the interface
 * @param interface is the interface to be configured. see sl_wfx_interface_t.
 *   @arg         SL_WFX_STA_INTERFACE
 *   @arg         SL_WFX_SOFTAP_INTERFACE
 * @returns Returns SL_STATUS_OK if the request has been sent correctly,
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_set_mac_address(const sl_wfx_mac_address_t *mac,
                                   sl_wfx_interface_t interface)
{
  sl_status_t result;
  sl_wfx_set_mac_address_req_body_t payload;

  memcpy(&payload.mac_addr, &mac->octet, sizeof(payload.mac_addr));
  result = sl_wfx_send_command(SL_WFX_SET_MAC_ADDRESS_REQ_ID, &payload,
                               sizeof(payload), interface, NULL);

  if (result == SL_STATUS_OK) {
    if (interface == SL_WFX_STA_INTERFACE) {
      memcpy(&(sl_wfx_context->mac_addr_0.octet), mac->octet,
             sizeof(sl_wfx_mac_address_t));
    }
    if (interface == SL_WFX_SOFTAP_INTERFACE) {
      memcpy(&(sl_wfx_context->mac_addr_1.octet), mac->octet,
             sizeof(sl_wfx_mac_address_t));
    }
  }
  return result;
}

/**************************************************************************//**
 * @brief As a station, send a command to join a Wi-Fi network
 *
 * @param ssid is the name of the AP to connect to
 * @param ssid_length is the length of the SSID name
 * @param bssid is the address of the AP to connect to (optional)
 * @param channel is the channel used by AP. Set at 0 if the channel is unknown
 * @param security_mode is the security used by the AP
 *   @arg         WFM_SECURITY_MODE_OPEN
 *   @arg         WFM_SECURITY_MODE_WEP
 *   @arg         WFM_SECURITY_MODE_WPA2_WPA1_PSK
 *   @arg         WFM_SECURITY_MODE_WPA2_PSK
 * @param prevent_roaming is equal to 1 to prevent automatic roaming between APs
 * @param management_frame_protection is equal to 1 to enable PMF mode
 * @param passkey is the passkey used by the AP. Can be the WPA hash key to
 * improve connection speed
 * @param passkey_length is the length of the passkey
 * @param ie_data are the Vendor-specific IEs to be added to the probe request
 * @param ie_data_length is the length of the IEs
 * @returns Returns SL_STATUS_OK if the command has been sent correctly,
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_send_join_command(const uint8_t  *ssid,
                                     uint32_t        ssid_length,
                                     const sl_wfx_mac_address_t *bssid,
                                     uint16_t        channel,
                                     sl_wfx_security_mode_t security_mode,
                                     uint8_t         prevent_roaming,
                                     uint16_t        management_frame_protection,
                                     const uint8_t  *passkey,
                                     uint16_t        passkey_length,
                                     const uint8_t  *ie_data,
                                     uint16_t        ie_data_length)
{
  sl_status_t               result           = SL_STATUS_OK;
  sl_wfx_generic_message_t  *frame           = NULL;
  sl_wfx_connect_cnf_t      *reply           = NULL;
  sl_wfx_connect_req_body_t *connect_request = NULL;
  uint32_t request_length  = SL_WFX_ROUND_UP_EVEN(sizeof(sl_wfx_connect_req_t) + ie_data_length);

