eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/sl_wfx.c
  result = sl_wfx_send_command(SL_WFX_GET_PMK_REQ_ID, NULL, 0, interface, (sl_wfx_generic_confirmation_t **)&reply);

  if (result == SL_STATUS_OK) {
    result = sl_wfx_get_status_code(sl_wfx_htole32(reply->body.status), SL_WFX_GET_PMK_REQ_ID);
    memcpy(password, reply->body.password, sl_wfx_htole32(reply->body.password_length));
    *password_length = sl_wfx_htole32(reply->body.password_length);
  }

  return result;
}

/**************************************************************************//**
 * @brief Get the signal strength of the last packets received from an AP client
 *
 * @param client is the mac address of the client
 * @param signal_strength returns the RCPI value averaged on the last packets
 * received. RCPI ranges from 0 - 220 with 220 corresponds to 0 dBm and each
 * increment represents an increase of 0.5 dBm.
 * @returns SL_STATUS_OK if the command has been sent correctly,
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_get_ap_client_signal_strength(const sl_wfx_mac_address_t *client, uint32_t *signal_strength)
{
  sl_status_t result;
  sl_wfx_get_ap_client_signal_strength_req_body_t payload;
  sl_wfx_get_ap_client_signal_strength_cnf_t *reply = NULL;

  memcpy(payload.mac, &client->octet, sizeof(payload.mac) );

  result = sl_wfx_send_command(SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_REQ_ID,
                               &payload,
                               sizeof(payload),
                               SL_WFX_SOFTAP_INTERFACE,
                               (sl_wfx_generic_confirmation_t **)&reply);

  if (result == SL_STATUS_OK) {
    result = sl_wfx_get_status_code(sl_wfx_htole32(reply->body.status), SL_WFX_GET_AP_CLIENT_SIGNAL_STRENGTH_REQ_ID);
    *signal_strength = sl_wfx_htole32(reply->body.rcpi);
  }

  return result;
}

/** @} end FULL_MAC_DRIVER_API */

/**************************************************************************//**
 * @addtogroup GENERAL_DRIVER_API
 * @{
 *****************************************************************************/

/**************************************************************************//**
 * @brief Function to send PDS chunks
 *
 * @param pds_data: Data to be sent in the compressed PDS format
 * @param pds_data_length: Size of the data to be sent
 * @returns SL_STATUS_OK if the configuration has been sent correctly,
 * SL_STATUS_FAIL otherwise
 *
 * @note The PDS (Platform Data Set) file contains the WF200 settings
 *****************************************************************************/
sl_status_t sl_wfx_send_configuration(const char *pds_data, uint32_t pds_data_length)
{
  sl_status_t                      result         = SL_STATUS_OK;
  sl_wfx_generic_message_t        *frame          = NULL;
  sl_wfx_configuration_cnf_t      *reply          = NULL;
  sl_wfx_configuration_req_body_t *config_request = NULL;
  uint32_t request_length = SL_WFX_ROUND_UP_EVEN(sizeof(sl_wfx_configuration_req_t) + pds_data_length);

  result = sl_wfx_allocate_command_buffer(&frame, SL_WFX_CONFIGURATION_REQ_ID, SL_WFX_CONTROL_BUFFER, request_length);
  SL_WFX_ERROR_CHECK(result);

  frame->header.info = SL_WFX_STA_INTERFACE << SL_WFX_MSG_INFO_INTERFACE_OFFSET;

  config_request = (sl_wfx_configuration_req_body_t *)&frame->body;
  config_request->length = sl_wfx_htole16(pds_data_length);

  memcpy(config_request->pds_data, pds_data, pds_data_length);

  result = sl_wfx_send_request(SL_WFX_CONFIGURATION_REQ_ID, frame, request_length);
  SL_WFX_ERROR_CHECK(result);

  result = sl_wfx_host_wait_for_confirmation(SL_WFX_CONFIGURATION_REQ_ID, SL_WFX_DEFAULT_REQUEST_TIMEOUT_MS, (void **)&reply);
  SL_WFX_ERROR_CHECK(result);

  result = sl_wfx_get_status_code(sl_wfx_htole32(reply->body.status), SL_WFX_CONFIGURATION_REQ_ID);

  error_handler:
  if (result == SL_STATUS_TIMEOUT) {
    if (sl_wfx_context->used_buffers > 0) {
      sl_wfx_context->used_buffers--;
    }
  }
  if (frame != NULL) {
    sl_wfx_free_command_buffer(frame, SL_WFX_CONFIGURATION_REQ_ID, SL_WFX_CONTROL_BUFFER);
  }
  return result;
}

/**************************************************************************//**
 * @brief Send a request to read or write a GPIO
 *
 * @param gpio_label is the GPIO label to control (defined in the PDS)
 * @param gpio_mode defines how to read or set the GPIO
 * @param value returns the read value or the detailed error cause
 * @returns SL_STATUS_OK if the request has been sent correctly,
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_control_gpio(uint8_t gpio_label, uint8_t gpio_mode, uint32_t *value)
{
  sl_status_t result;
  sl_wfx_control_gpio_cnf_t *reply = NULL;
  sl_wfx_control_gpio_req_body_t payload;

  payload.gpio_label = gpio_label;
  payload.gpio_mode = gpio_mode;

  result = sl_wfx_send_command(SL_WFX_CONTROL_GPIO_REQ_ID, &payload, sizeof(payload), SL_WFX_STA_INTERFACE, (sl_wfx_generic_confirmation_t **)&reply);

  if (result == SL_STATUS_OK) {
    result = sl_wfx_get_status_code(sl_wfx_htole32(reply->body.status), SL_WFX_CONTROL_GPIO_REQ_ID);
    *value = sl_wfx_htole32(reply->body.value);
  }

  return result;
}

/**************************************************************************//**
 * @brief Send a request to set the PTA mode, the active levels on signals, the Coex type,
 * to define the timings, quotas, combined mode and default grant state.
 *
 * @param pta_mode defines the mode to use
 *   @arg         SL_WFX_PTA_1W_WLAN_MASTER
 *   @arg         SL_WFX_PTA_1W_COEX_MASTER
 *   @arg         SL_WFX_PTA_2W
 *   @arg         SL_WFX_PTA_3W
 *   @arg         SL_WFX_PTA_4W
 * @param request_signal_active_level is the active level on REQUEST signal (PTA_RF_ACT pin)
 * @param priority_signal_active_level is the active level on PRIORITY signal (PTA_STATUS pin)
 * @param freq_signal_active_level is the active level on FREQ signal (PTA_FREQ pin)
 * @param grant_signal_active_level is the active level on GRANT signal (PTA_TX_CONF pin)
 *   @arg         SL_WFX_SIGNAL_LOW
 *   @arg         SL_WFX_SIGNAL_HIGH
 * @param coex_type
 *   @arg         SL_WFX_COEX_TYPE_GENERIC
 *   @arg         SL_WFX_COEX_TYPE_BLE
 * @param default_grant_state is the state of the GRANT signal before arbitration at grant_valid_time
 *   @arg         SL_WFX_NO_GRANT
 *   @arg         SL_WFX_GRANT
 * @param simultaneous_rx_access is a boolean to allow both Coex and Wlan to receive concurrently, also named combined mode
 * @param priority_sampling_time is the time (in microseconds) from the Coex request to the sampling of the priority on PRIORITY signal (1 to 31)
 * @param tx_rx_sampling_time is the time (in microseconds) from the Coex request to the sampling of the directionality on PRIORITY signal (priority_sampling_time to 63)
 * @param freq_sampling_time is the time (in microseconds) from the Coex request to the sampling of freq-match information on FREQ signal (1 to 127)
 * @param grant_valid_time is the time (in microseconds) from Coex request to the GRANT signal assertion (MAX(tx_rx_sampling_time, freq_sampling_time) to 255)
 * @param fem_control_time is the time (in microseconds) from Coex request to the control of FEM (grant_valid_time to 255)
 * @param first_slot_time is the time (in microseconds) from the Coex request to the beginning of reception or transmission (grant_valid_time to 255)
 * @param periodic_tx_rx_sampling_time is the period (in microseconds) from first_slot_time of following samplings of the directionality on PRIORITY signal (1 to 1023)
 * @param coex_quota is the duration (in microseconds) for which RF is granted to Coex before it is moved to Wlan
 * @param wlan_quota is the duration (in microseconds) for which RF is granted to Wlan before it is moved to Coex
 * @returns SL_STATUS_OK if the request has been sent correctly,
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_pta_settings(uint8_t pta_mode,
                                uint8_t request_signal_active_level,
                                uint8_t priority_signal_active_level,
                                uint8_t freq_signal_active_level,
                                uint8_t grant_signal_active_level,
                                uint8_t coex_type,
                                uint8_t default_grant_state,
                                uint8_t simultaneous_rx_access,
                                uint8_t priority_sampling_time,
                                uint8_t tx_rx_sampling_time,
                                uint8_t freq_sampling_time,
                                uint8_t grant_valid_time,
                                uint8_t fem_control_time,
                                uint8_t first_slot_time,
                                uint16_t periodic_tx_rx_sampling_time,
                                uint16_t coex_quota,
                                uint16_t wlan_quota)
{
  sl_status_t result;
  sl_wfx_pta_settings_req_body_t payload;

  payload.pta_mode                     = pta_mode;
  payload.request_signal_active_level  = request_signal_active_level;
  payload.priority_signal_active_level = priority_signal_active_level;
  payload.freq_signal_active_level     = freq_signal_active_level;
  payload.grant_signal_active_level    = grant_signal_active_level;
  payload.coex_type                    = coex_type;
  payload.default_grant_state          = default_grant_state;
  payload.simultaneous_rx_access       = simultaneous_rx_access;
  payload.priority_sampling_time       = priority_sampling_time;
  payload.tx_rx_sampling_time          = tx_rx_sampling_time;
  payload.freq_sampling_time           = freq_sampling_time;
  payload.grant_valid_time             = grant_valid_time;
  payload.fem_control_time             = fem_control_time;
  payload.first_slot_time              = first_slot_time;
  payload.periodic_tx_rx_sampling_time = sl_wfx_htole16(periodic_tx_rx_sampling_time);
  payload.coex_quota                   = sl_wfx_htole16(coex_quota);
  payload.wlan_quota                   = sl_wfx_htole16(wlan_quota);

  result = sl_wfx_send_command(SL_WFX_PTA_SETTINGS_REQ_ID, &payload, sizeof(payload), SL_WFX_STA_INTERFACE, NULL);

  return result;
}

/**************************************************************************//**
 * @brief Send a request to define the level of priority used to arbitrate concurrent Coex and Wlan requests.
 *
 * @param priority defines the priority levels for concurrent Coex and WLAN request arbitration
 *   @arg         SL_WFX_PTA_PRIORITY_COEX_MAXIMIZED
 *   @arg         SL_WFX_PTA_PRIORITY_COEX_HIGH
 *   @arg         SL_WFX_PTA_PRIORITY_BALANCED
 *   @arg         SL_WFX_PTA_PRIORITY_WLAN_HIGH
 *   @arg         SL_WFX_PTA_PRIORITY_WLAN_MAXIMIZED
 * @returns SL_STATUS_OK if the request has been sent correctly,
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_pta_priority(uint32_t priority)
{
  sl_status_t result;
  sl_wfx_pta_priority_req_body_t payload;

