eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/sl_wfx.c
    if (sl_wfx_secure_link_encryption_required_get(command_id) == SL_WFX_SECURE_LINK_ENCRYPTION_REQUIRED) {
      // Nonce for encryption should have RX and HP counters 0, only use TX counter
      sl_wfx_nonce_t encryption_nonce = { 0, 0, sl_wfx_context->secure_link_nonce.tx_packet_count };

#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_SLK)
      sl_wfx_host_log("TX packet %lu\n", sl_wfx_context->secure_link_nonce.tx_packet_count);
#endif

      // Round up to next crypto block size the part that will be ciphered
      request_length = ((request_length + 15 - 2) & ~15) + 2;

      // Encrypt the data
      result = sl_wfx_host_encode_secure_link_data(request,
                                                   request_length - 2,
                                                   sl_wfx_context->secure_link_session_key,
                                                   (uint8_t *)&encryption_nonce);
      SL_WFX_ERROR_CHECK(result);

      // Write the secure link header
      uint16_t *secure_link_header = (uint16_t *)((uint8_t *)request - 4);
      *secure_link_header = sl_wfx_htole16((uint16_t) (sl_wfx_context->secure_link_nonce.tx_packet_count & 0xFFFF));
      secure_link_header++;
      *secure_link_header = sl_wfx_htole16((uint16_t) (0x4000 | ( (sl_wfx_context->secure_link_nonce.tx_packet_count >> 16) & 0x3FFF)));

      sl_wfx_context->secure_link_nonce.tx_packet_count++;

      if (sl_wfx_context->secure_link_nonce.tx_packet_count > SL_WFX_SECURE_LINK_NONCE_WATERMARK
          && sl_wfx_context->secure_link_renegotiation_state == SL_WFX_SECURELINK_DEFAULT) {
#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_SLK)
        sl_wfx_host_log("--SLK renegotiation needed--\r\n");
#endif
        //queue key re-negotiation
        sl_wfx_context->secure_link_renegotiation_state = SL_WFX_SECURELINK_RENEGOTIATION_NEEDED;
      }

      // Add the secure link buffer overhead and transmit
      request_length += SL_WFX_SECURE_LINK_HEADER_SIZE + SL_WFX_SECURE_LINK_CCM_TAG_SIZE;
      request = (sl_wfx_generic_message_t *)((uint8_t *)request - SL_WFX_SECURE_LINK_HEADER_SIZE);
    }
#endif //SL_WFX_USE_SECURE_LINK

    if (command_id != SL_WFX_SEND_FRAME_REQ_ID
        && command_id != SL_WFX_SHUT_DOWN_REQ_ID) {
      result = sl_wfx_host_setup_waited_event(command_id);
      SL_WFX_ERROR_CHECK(result);
    }

    result = sl_wfx_host_transmit_frame(request, request_length);
    SL_WFX_ERROR_CHECK(result);

    sl_wfx_context->used_buffers++;
  }

  error_handler:
  unlock_result = sl_wfx_host_unlock();
  if (unlock_result != SL_STATUS_OK) {
    result = unlock_result;
  }

#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_ERROR)
  if (result != SL_STATUS_OK) {
    sl_wfx_host_log("Send request error %u\n", result);
  }
#endif
  return result;
}

/**************************************************************************//**
 * @brief Receive available frame from the Wi-Fi chip
 *
 * @param ctrl_reg is the control register value of the last call of
 * sl_wfx_receive_frame(). If equal to 0, the driver will read the control
 * register.
 * @returns SL_STATUS_OK if the frame has been received correctly,
 * SL_STATUS_WIFI_NO_PACKET_TO_RECEIVE if no frame are pending inside the Wi-Fi chip
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_receive_frame(uint16_t *ctrl_reg)
{
  sl_status_t               result;
  sl_status_t               unlock_result;
  sl_wfx_generic_message_t *network_rx_buffer = NULL;
  sl_wfx_received_message_type_t message_type;
  sl_wfx_buffer_type_t      buffer_type = SL_WFX_RX_FRAME_BUFFER;
  uint32_t                  read_length, frame_size;

  result = sl_wfx_host_lock();

  if (result != SL_STATUS_OK) {
#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_ERROR)
    sl_wfx_host_log("Receive frame lock error %u\n", result);
#endif
    //if driver lock is not successful, return immediatly
    return result;
  }

  frame_size = (*ctrl_reg & SL_WFX_CONT_NEXT_LEN_MASK) * 2;
  /* if frame_size is equal to 0, read the control register to know the frame size */
  if (frame_size == 0) {
    /* Read the control register */
    result = sl_wfx_reg_read_16(SL_WFX_CONTROL_REG_ID, ctrl_reg);
    SL_WFX_ERROR_CHECK(result);
    frame_size = (*ctrl_reg & SL_WFX_CONT_NEXT_LEN_MASK) * 2;
    /* At this point, if frame_size is equal to zero, nothing to be read by the host */
    if (frame_size == 0) {
      result = SL_STATUS_WIFI_NO_PACKET_TO_RECEIVE;
      SL_WFX_ERROR_CHECK(result);
    }
  }

  /* retrieve the message type from the control register*/
  message_type = (sl_wfx_received_message_type_t)((*ctrl_reg & SL_WFX_CONT_FRAME_TYPE_INFO) >> SL_WFX_CONT_FRAME_TYPE_OFFSET);

  /* critical : '+SL_WFX_CONT_REGISTER_SIZE' is to read the piggy-back value at
     the end of the control register. */
  read_length = frame_size + SL_WFX_CONT_REGISTER_SIZE;

  /* Depending on the message type provided by the control register, allocate a
     control buffer or a ethernet RX frame */
  buffer_type = (message_type == SL_WFX_ETHERNET_DATA_MESSAGE) ? SL_WFX_RX_FRAME_BUFFER : SL_WFX_CONTROL_BUFFER;

  result = sl_wfx_host_allocate_buffer((void **)&network_rx_buffer,
                                       buffer_type,
                                       SL_WFX_ROUND_UP(read_length, SL_WFX_ROUND_UP_VALUE));
  SL_WFX_ERROR_CHECK(result);

  memset(network_rx_buffer, 0, read_length);

  /* Read the frame from WF200 */
  result = sl_wfx_data_read(network_rx_buffer, read_length);
  SL_WFX_ERROR_CHECK(result);

  /* if the frame is a confirmation, decrease used_buffers value */
  if ((sl_wfx_context->used_buffers > 0)
      && (!(network_rx_buffer->header.id & SL_WFX_IND_BASE))) {
    sl_wfx_context->used_buffers--;
  }

  /* read the control register value in the piggy back and pass it to the host */
  *ctrl_reg = sl_wfx_unpack_16bit_little_endian(((uint8_t *)network_rx_buffer) + frame_size);

#ifdef SL_WFX_USE_SECURE_LINK
  // Bit 14/15 of second word indicates if it is encrypted
  if ((network_rx_buffer->header.info & SL_WFX_MSG_INFO_SECURE_LINK_MASK) != 0) {
    uint16_t *nonce_ptr = (uint16_t *) network_rx_buffer;
    uint32_t new_packet_count = sl_wfx_unpack_16bit_little_endian(&network_rx_buffer->header.length);
    nonce_ptr++;
    new_packet_count |= (*nonce_ptr & 0x3FFF) << 16;

