eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/radio/wifi/wfx_fmac_driver/sl_wfx.c
  if (sl_wfx_context->state & SL_WFX_POWER_SAVE_ACTIVE) {
    /* Power save is already active, return */
    result = SL_STATUS_FAIL;
    SL_WFX_ERROR_CHECK(result);
  }

  result = sl_wfx_set_wake_up_bit(0);
  SL_WFX_ERROR_CHECK(result);

  sl_wfx_context->state |= SL_WFX_POWER_SAVE_ACTIVE;

  result = sl_wfx_host_set_wake_up_pin(0);
  SL_WFX_ERROR_CHECK(result);

  sl_wfx_context->state |= SL_WFX_SLEEPING;

#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_SLEEP)
  sl_wfx_host_log("Power save enabled\r\n");
#endif

  error_handler:
  return result;
}

/**************************************************************************//**
 * @brief Disable the power save feature in the FMAC driver and prevent the WFx
 * going in sleep mode
 *
 * @return SL_STATUS_OK if the bit has been set correctly, SL_STATUS_FAIL otherwise
 *****************************************************************************/
sl_status_t sl_wfx_disable_device_power_save(void)
{
  sl_status_t result;

  if (!(sl_wfx_context->state & SL_WFX_POWER_SAVE_ACTIVE)) {
    /* Power save is already disable, return */
    result = SL_STATUS_FAIL;
    SL_WFX_ERROR_CHECK(result);
  }

  sl_wfx_context->state &= ~SL_WFX_POWER_SAVE_ACTIVE;

  result = sl_wfx_host_set_wake_up_pin(1);
  SL_WFX_ERROR_CHECK(result);
  result = sl_wfx_host_wait_for_wake_up();
  SL_WFX_ERROR_CHECK(result);
  sl_wfx_context->state &= ~SL_WFX_SLEEPING;

  result = sl_wfx_set_wake_up_bit(1);
  SL_WFX_ERROR_CHECK(result);

#if (SL_WFX_DEBUG_MASK & SL_WFX_DEBUG_SLEEP)
  sl_wfx_host_log("Power save disabled\r\n");
#endif

  error_handler:
  return result;
}

/******************************************************
*                 Static Functions
******************************************************/

/**************************************************************************//**
 * @brief Init the Wi-Fi chip
 *
 * @return SL_STATUS_OK if the initialization is successful, SL_STATUS_FAIL otherwise
 *****************************************************************************/
static sl_status_t sl_wfx_init_chip(void)
{
  sl_status_t status;
  uint32_t    value32;
  uint16_t    value16;

  status = sl_wfx_reg_read_32(SL_WFX_CONFIG_REG_ID, &value32);
  SL_WFX_ERROR_CHECK(status);

  /* General purpose registers setting */
  status = sl_wfx_reg_write_32(SL_WFX_TSET_GEN_R_W_REG_ID, 0x07208775);
  SL_WFX_ERROR_CHECK(status);
  status = sl_wfx_reg_write_32(SL_WFX_TSET_GEN_R_W_REG_ID, 0x082ec020);
  SL_WFX_ERROR_CHECK(status);
  status = sl_wfx_reg_write_32(SL_WFX_TSET_GEN_R_W_REG_ID, 0x093c3c3c);
  SL_WFX_ERROR_CHECK(status);
  status = sl_wfx_reg_write_32(SL_WFX_TSET_GEN_R_W_REG_ID, 0x0b322c44);
  SL_WFX_ERROR_CHECK(status);
  status = sl_wfx_reg_write_32(SL_WFX_TSET_GEN_R_W_REG_ID, 0x0ca06497);
  SL_WFX_ERROR_CHECK(status);

  /* set wake-up bit */
  status = sl_wfx_reg_read_16(SL_WFX_CONTROL_REG_ID, &value16);
  SL_WFX_ERROR_CHECK(status);
  value16 |= SL_WFX_CONT_WUP_BIT;
  status = sl_wfx_reg_write_16(SL_WFX_CONTROL_REG_ID, value16);
  SL_WFX_ERROR_CHECK(status);

  /* .. and wait for wake-up */
  for (uint32_t i = 0; i < 200; ++i) {
    status = sl_wfx_reg_read_16(SL_WFX_CONTROL_REG_ID, &value16);
    SL_WFX_ERROR_CHECK(status);

    if ((value16 & SL_WFX_CONT_RDY_BIT) == SL_WFX_CONT_RDY_BIT) {
      break;
    } else {
      sl_wfx_host_wait(1);
    }
  }

  if ((value16 & SL_WFX_CONT_RDY_BIT) != SL_WFX_CONT_RDY_BIT) {
    status = SL_STATUS_TIMEOUT;
    SL_WFX_ERROR_CHECK(status);
  }

  /* check for access mode bit */
  status = sl_wfx_reg_read_32(SL_WFX_CONFIG_REG_ID, &value32);
  SL_WFX_ERROR_CHECK(status);
  if ((value32 & SL_WFX_CONFIG_ACCESS_MODE_BIT) == 0) {
    status = SL_STATUS_FAIL;
    SL_WFX_ERROR_CHECK(status);
  }

  error_handler:
  return status;
}

/**************************************************************************//**
 * @brief run the Wi-Fi chip bootloader
 *
 * @return SL_STATUS_OK if the bootloader runs correctly, SL_STATUS_FAIL otherwise
 *****************************************************************************/
static sl_status_t sl_wfx_download_run_bootloader(void)
{
  sl_status_t status;
  uint32_t    value32;

  status = sl_wfx_apb_read_32(ADDR_DWL_CTRL_AREA_NCP_STATUS, &value32);
  SL_WFX_ERROR_CHECK(status);

  /* release CPU from reset and enable clock */
  status = sl_wfx_reg_read_32(SL_WFX_CONFIG_REG_ID, &value32);
  SL_WFX_ERROR_CHECK(status);
  value32 &= ~(SL_WFX_CONFIG_CPU_RESET_BIT | SL_WFX_CONFIG_CPU_CLK_DIS_BIT);
  status = sl_wfx_reg_write_32(SL_WFX_CONFIG_REG_ID, value32);
  SL_WFX_ERROR_CHECK(status);

  /* Testing SRAM access */
  status = sl_wfx_apb_write_32(ADDR_DOWNLOAD_FIFO_BASE, 0x23abc88e);
  SL_WFX_ERROR_CHECK(status);

  /* Check if the write command is successful */
  status = sl_wfx_apb_read_32(ADDR_DOWNLOAD_FIFO_BASE, &value32);
  SL_WFX_ERROR_CHECK(status);
  if (value32 != 0x23abc88e) {
    status = SL_STATUS_FAIL;
    SL_WFX_ERROR_CHECK(status);
  }

  error_handler:
  return status;
}

/**************************************************************************//**
 * @brief Download the Wi-Fi chip firmware
 *
 * @return SL_STATUS_OK if the firmware is downloaded correctly,
 * SL_STATUS_WIFI_INVALID_KEY if the firmware keyset does not match the chip one,
 * SL_STATUS_WIFI_FIRMWARE_DOWNLOAD_TIMEOUT or SL_STATUS_TIMEOUT if the process times out,
 * SL_STATUS_FAIL otherwise
 *****************************************************************************/
static sl_status_t sl_wfx_download_run_firmware(void)
{
  sl_status_t    status;
  uint32_t       i;
  uint32_t       value32;
  uint32_t       image_length;
  uint32_t       block;
  uint32_t       num_blocks;
  uint32_t       put = 0;
  uint32_t       get = 0;
  const uint8_t *buffer;

  status = sl_wfx_host_init();
  SL_WFX_ERROR_CHECK(status);

  status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_HOST_STATUS, HOST_STATE_NOT_READY);
  SL_WFX_ERROR_CHECK(status);
  status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_PUT, 0);
  SL_WFX_ERROR_CHECK(status);
  status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_GET, 0);
  SL_WFX_ERROR_CHECK(status);
  status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_HOST_STATUS, HOST_STATE_READY);
  SL_WFX_ERROR_CHECK(status);

  // wait for INFO_READ state
  status = sl_wfx_poll_for_value(ADDR_DWL_CTRL_AREA_NCP_STATUS, NCP_STATE_INFO_READY, 100);
  SL_WFX_ERROR_CHECK(status);

  // read info
  status = sl_wfx_apb_read_32(0x0900C080, &value32);
  SL_WFX_ERROR_CHECK(status);

  // retrieve WF200 keyset
  status = sl_wfx_apb_read_32(SL_WFX_PTE_INFO + 12, &value32);
  SL_WFX_ERROR_CHECK(status);
  encryption_keyset = (value32 >> 8);

  // report that info is read
  status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_HOST_STATUS, HOST_STATE_HOST_INFO_READ);
  SL_WFX_ERROR_CHECK(status);

  // wait for READY state
  status = sl_wfx_poll_for_value(ADDR_DWL_CTRL_AREA_NCP_STATUS, NCP_STATE_READY, 100);
  SL_WFX_ERROR_CHECK(status);

  // SB misc initialization. Work around for chips < A2.
  status = sl_wfx_apb_write_32(ADDR_DOWNLOAD_FIFO_BASE, 0xFFFFFFFF);
  SL_WFX_ERROR_CHECK(status);

  // write image length
  sl_wfx_host_get_firmware_size(&image_length);
  status = sl_wfx_apb_write_32(ADDR_DWL_CTRL_AREA_IMAGE_SIZE, image_length - FW_HASH_SIZE - FW_SIGNATURE_SIZE - FW_KEYSET_SIZE);
  SL_WFX_ERROR_CHECK(status);

  // get firmware keyset, which is the first FW_KEYSET_SIZE of given image
  status = sl_wfx_host_get_firmware_data(&buffer, FW_KEYSET_SIZE);
  SL_WFX_ERROR_CHECK(status);

